[
	{
		"id": "webb2018",
		"type": "article-journal",
		"abstract": "Concept drift and shift are major issues that greatly affect the accuracy and reliability of many real-world applications of machine learning. We propose a new data mining task, concept drift mapping—the description and analysis of instances of concept drift or shift. We argue that concept drift mapping is an essential prerequisite for tackling concept drift and shift. We propose tools for this purpose, arguing for the importance of quantitative descriptions of drift and shift in marginal distributions. We present quantitative concept drift mapping techniques, along with methods for visualizing their results. We illustrate their effectiveness for real-world applications across energy-pricing, vegetation monitoring and airline scheduling.",
		"container-title": "Data Mining and Knowledge Discovery",
		"DOI": "10.1007/s10618-018-0554-1",
		"ISSN": "1573-756X",
		"issue": "5",
		"journalAbbreviation": "Data Min Knowl Disc",
		"language": "en",
		"license": "All rights reserved",
		"page": "1179-1199",
		"source": "Springer Link",
		"title": "Analyzing concept drift and shift from sample data",
		"URL": "https://doi.org/10.1007/s10618-018-0554-1",
		"volume": "32",
		"author": [
			{
				"family": "Webb",
				"given": "Geoffrey I."
			},
			{
				"family": "Lee",
				"given": "Loong Kuan"
			},
			{
				"family": "Goethals",
				"given": "Bart"
			},
			{
				"family": "Petitjean",
				"given": "François"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2018",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2018",
					9,
					1
				]
			]
		}
	},
	{
		"id": "lee2022",
		"type": "article",
		"abstract": "There are many applications that benefit from computing the exact divergence between 2 discrete probability measures, including machine learning. Unfortunately, in the absence of any assumptions on the structure or independencies within these distributions, computing the divergence between them is an intractable problem in high dimensions. We show that we are able to compute a wide family of functionals and divergences, such as the alpha-beta divergence, between two decomposable models, i.e. chordal Markov networks, in time exponential to the treewidth of these models. The alpha-beta divergence is a family of divergences that include popular divergences such as the Kullback-Leibler divergence, the Hellinger distance, and the chi-squared divergence. Thus, we can accurately compute the exact values of any of this broad class of divergences to the extent to which we can accurately model the two distributions using decomposable models.",
		"DOI": "10.48550/arXiv.2112.04583",
		"license": "All rights reserved",
		"note": "arXiv:2112.04583 [cs]",
		"number": "arXiv:2112.04583",
		"publisher": "arXiv",
		"source": "arXiv.org",
		"title": "Computing Divergences between Discrete Decomposable Models",
		"URL": "http://arxiv.org/abs/2112.04583",
		"author": [
			{
				"family": "Lee",
				"given": "Loong Kuan"
			},
			{
				"family": "Piatkowski",
				"given": "Nico"
			},
			{
				"family": "Petitjean",
				"given": "François"
			},
			{
				"family": "Webb",
				"given": "Geoffrey I."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2022",
					12,
					11
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2022",
					11,
					30
				]
			]
		}
	}
]